mskorge/ivt490-esp8266/ivt/src/main.cpp
#include <FS.h>                   //this needs to be first, or it all crashes and burns...

#include <ESP8266WiFi.h>          //https://github.com/esp8266/Arduino

//needed for library
#include <DNSServer.h>
#include <ESP8266WebServer.h>
#include <WiFiManager.h>          //https://github.com/tzapu/WiFiManager

//#include <Arduino.h>
#include <SoftwareSerial.h>
#include <ArduinoJson.h>
#include <PubSubClient.h>

//define your default values here, if there are different values in config.json, they are overwritten.
char mqtt_server[40] = "192.168.1.123";
char mqtt_port[6] = "1883";
char blynk_token[34] = "YOUR_BLYNK_TOKEN";

//flag for saving data
bool shouldSaveConfig = false;

//callback notifying us of the need to save config
void saveConfigCallback () {
  Serial.println("Should save config");
  shouldSaveConfig = true;
}

//WIFI settings
//const char* ssid = "MyWIFI";
//const char* password = "secret";

String inputString;
boolean stringComplete = false;
char inChar;
int counter;
int commaPosition;
float ivt[50];

//IP address of MQTT server
//IPAddress MQTTserver(192, 168, 2, 191);

//WiFiClient wClient;
//PubSubClient client(MQTTserver, 1883, wclient);
//PubSubClient mqttClient(wClient, mqtt_server, mqtt_port);
WiFiClient espClient;
PubSubClient mqttClient(espClient);

SoftwareSerial swSer(14, 12, false, 128);

float stringToFloat(String input){
  String stringTemp = input;
  char stfarray[stringTemp.length() + 1];
  stringTemp.toCharArray(stfarray, sizeof(stfarray));
  float stf = atof(stfarray);
  stringTemp = "";
  memset(stfarray, 0, sizeof stfarray);
  return stf; 
}

void setup() {
  // put your setup code here, to run once:
  Serial.begin(115200);
  Serial.println();

  //clean FS, for testing
  //SPIFFS.format();

  //read configuration from FS json
  Serial.println("mounting FS...");

  if (SPIFFS.begin()) {
    Serial.println("mounted file system");
    if (SPIFFS.exists("/config.json")) {
      //file exists, reading and loading
      Serial.println("reading config file");
      File configFile = SPIFFS.open("/config.json", "r");
      if (configFile) {
        Serial.println("opened config file");
        size_t size = configFile.size();
        // Allocate a buffer to store contents of the file.
        std::unique_ptr<char[]> buf(new char[size]);

        configFile.readBytes(buf.get(), size);
        DynamicJsonBuffer jsonBuffer;
        JsonObject& json = jsonBuffer.parseObject(buf.get());
        json.printTo(Serial);
        if (json.success()) {
          Serial.println("\nparsed json");

          strcpy(mqtt_server, json["mqtt_server"]);
          strcpy(mqtt_port, json["mqtt_port"]);
          strcpy(blynk_token, json["blynk_token"]);

        } else {
          Serial.println("failed to load json config");
        }
      }
    }
  } else {
    Serial.println("failed to mount FS");
  }
  //end read



  // The extra parameters to be configured (can be either global or just in the setup)
  // After connecting, parameter.getValue() will get you the configured value
  // id/name placeholder/prompt default length
  WiFiManagerParameter custom_mqtt_server("server", "mqtt server", mqtt_server, 40);
  WiFiManagerParameter custom_mqtt_port("port", "mqtt port", mqtt_port, 5);
  WiFiManagerParameter custom_blynk_token("blynk", "blynk token", blynk_token, 32);

  //WiFiManager
  //Local intialization. Once its business is done, there is no need to keep it around
  WiFiManager wifiManager;

  //set config save notify callback
  wifiManager.setSaveConfigCallback(saveConfigCallback);

  //set static ip
  wifiManager.setSTAStaticIPConfig(IPAddress(10,0,1,99), IPAddress(10,0,1,1), IPAddress(255,255,255,0));
  
  //add all your parameters here
  wifiManager.addParameter(&custom_mqtt_server);
  wifiManager.addParameter(&custom_mqtt_port);
  wifiManager.addParameter(&custom_blynk_token);

  //reset settings - for testing
  //wifiManager.resetSettings();

  //set minimu quality of signal so it ignores AP's under that quality
  //defaults to 8%
  //wifiManager.setMinimumSignalQuality();
  
  //sets timeout until configuration portal gets turned off
  //useful to make it all retry or go to sleep
  //in seconds
  //wifiManager.setTimeout(120);

  //fetches ssid and pass and tries to connect
  //if it does not connect it starts an access point with the specified name
  //here  "AutoConnectAP"
  //and goes into a blocking loop awaiting configuration
  if (!wifiManager.autoConnect("AutoConnectAP", "password")) {
    Serial.println("failed to connect and hit timeout");
    delay(3000);
    //reset and try again, or maybe put it to deep sleep
    ESP.reset();
    delay(5000);
  }

  //if you get here you have connected to the WiFi
  Serial.println("connected...yeey :)");

  //read updated parameters
  strcpy(mqtt_server, custom_mqtt_server.getValue());
  strcpy(mqtt_port, custom_mqtt_port.getValue());
  strcpy(blynk_token, custom_blynk_token.getValue());

  mqttClient.setServer(mqtt_server,1883);

  //save the custom parameters to FS
  if (shouldSaveConfig) {
    Serial.println("saving config");
    DynamicJsonBuffer jsonBuffer;
    JsonObject& json = jsonBuffer.createObject();
    json["mqtt_server"] = mqtt_server;
    json["mqtt_port"] = mqtt_port;
    json["blynk_token"] = blynk_token;

    File configFile = SPIFFS.open("/config.json", "w");
    if (!configFile) {
      Serial.println("failed to open config file for writing");
    }

    json.printTo(Serial);
    json.printTo(configFile);
    configFile.close();
    //end save
  }

  Serial.println("local ip");
  Serial.println(WiFi.localIP());

}


void mqttCommand(char* payload) {
  Serial.println("Publishing command");
  Serial.println(payload);
  mqttClient.publish("/ivt/output", payload);
  }

void fetchSerial ()
{
  while(swSer.available() > 0)
  {
    inChar = swSer.read();
    if(inChar != 32){
      inputString += inChar;
    }
    delay(2);
  }
  inChar = '0';
  Serial.println(inputString);
  stringComplete = true;
}

void splitString ()
{ 
  commaPosition = inputString.indexOf(';');
  while(commaPosition >= 0)
  {
    commaPosition = inputString.indexOf(';');
    if(commaPosition != -1)
    {
      ivt[counter] = stringToFloat(inputString.substring(0,commaPosition));
      inputString = inputString.substring(commaPosition+1, inputString.length());    
    }
    else
    {
      if(inputString.length() > 0){
        ivt[counter] = stringToFloat(inputString.substring(0,commaPosition));
      }
    }
    counter++;
  }
  counter = 0;
  inputString = "";
  commaPosition = 0;

  StaticJsonBuffer<800> jsonBuffer;
  JsonObject& root = jsonBuffer.createObject();
  
  root["framledn"] = ivt[1]; //Framledning
  root["ute"] = ivt[2]; //Ute
  root["tappvarmvtopp"] = ivt[3]; //Tappvarmvatten Topp
  root["varmevmitt"] = ivt[4]; //Varmvatten Mitt
  root["varmevbotton"] = ivt[5]; //Värmevatten Botten
  root["inne"] = ivt[6]; //Rumstemp
  root["hetgas"] = ivt[7]; //Hetgas
  root["egtemp"] = ivt[8]; //Extra Acc-Tank
  root["tryckvakt"] = ivt[9]; //Tryckvakt
  root["hogtryck"] = ivt[10]; //Högtryck
  root["lagtryck"] = ivt[11]; //Lågtryck
  root["egsemester"] = ivt[12]; //Semester aktiv?
  root["kompressor"] = ivt[13]; //Kompressor aktiv
  root["schuntoppen"] = ivt[14]; //SV1 Öppna
  root["schuntstangd"] = ivt[15]; //SV1 Stäng
  root["cirkpump"] = ivt[16]; //P1 Rad
  //root["flakt"] = ivt[17]; //Fläkt
  root["larm"] = ivt[18]; //Larm aktiv
  //root["20"] = ivt[19]; //Extern P2
  //root["21"] = ivt[20]; //LLT GT1
  //root["22"] = ivt[21]; //LL GT1
  root["bvframledning"] = ivt[22]; //BV GT1
  //root["24"] = ivt[23]; //UL GT1
  //root["25"] = ivt[24]; //LL GT3:2
  //root["26"] = ivt[25]; //ULT GT3:2
  //root["27"] = ivt[26]; //UL GT3:2
  //root["28"] = ivt[27]; //LL GT3:3
  //root["29"] = ivt[28]; //BV GT3:3
  root["extravv1"] = ivt[29]; //SV3 BV Förskj
  root["extravv2"] = ivt[30]; //Effekt ink vit VV behov
  root["extravv3"] = ivt[31]; //Tillskotstimer VV behov
  //root["33"] = ivt[32];   //Tappv prio
  root["elpatron"] = ivt[33]; //Tillskott i %/10
  //root["35"] = ivt[34]; //Tillskott RAD
  root["extravv4"] = ivt[35]; //Tillskott Tillägg
  //root["37"] = ivt[36]; //Default SV2 Open

  //Debug to serial terminal
  //root.prettyPrintTo(Serial);

  char buffer[800];
  root.printTo(buffer, sizeof(buffer));

  memset(ivt, 0, sizeof ivt);
  stringComplete = false;

  Serial.println(buffer);
  mqttCommand(buffer);
  
}

void loop() {
  mqttClient.loop(); 
  if(swSer.available() > 0)
  {
    fetchSerial();
  }
  if(stringComplete == true){
    delay(10);
    splitString();
    delay(50);
  }
}